# ETL process
Loads data from CSV data sources into a PostgreSQL database

Most data is from world development indicators and has 4 extra header rows. We remove columns with all N/A data including 2021 and an extra empty column at the end.

In [1]:
# Dependencies
import pandas as pd

# Python SQL toolkit and Object Relational Mapper
import sqlalchemy
# from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, func

from pathlib import Path

In [2]:
resources = Path.cwd() / 'resources'

In [3]:
# for sqlite
# engine = create_engine("sqlite:///db.sqlite")

# for postgresql
# must create a new database "predicting_population" using pgAdmin first
from config import db_password
db_string = f"postgresql://postgres:{db_password}@127.0.0.1:5432/predicting_population"
engine = create_engine(db_string)

## Countries

Loads from a CSV copy of all [ISO country codes](https://www.iso.org/obp/ui/#search)

In [4]:
df = pd.read_csv(resources / "iso_countries.csv")

In [5]:
df.drop(columns=['French short name', 'Numeric'], inplace=True)

In [6]:
df.columns = ['short_name', 'code2', 'code3']

In [7]:
df

          short_name code2 code3
0        Afghanistan    AF   AFG
1            Albania    AL   ALB
2            Algeria    DZ   DZA
3     American Samoa    AS   ASM
4            Andorra    AD   AND
..               ...   ...   ...
244  Western Sahara*    EH   ESH
245            Yemen    YE   YEM
246           Zambia    ZM   ZMB
247         Zimbabwe    ZW   ZWE
248    Åland Islands    AX   ALA

[249 rows x 3 columns]

In [8]:
df.to_sql('countries', engine, if_exists='replace')

## Population

In [9]:
df = pd.read_csv(resources / "population.csv", skiprows=4).dropna(axis='columns', how='all')
df.drop(columns=['Country Name', 'Indicator Name', 'Indicator Code'], inplace=True)
# unpivot
df = pd.melt(df, id_vars="Country Code")

In [10]:
df.columns = ['country_code3', 'year', 'value']
df

      country_code3  year        value
0               ABW  1960      54208.0
1               AFE  1960  130836765.0
2               AFG  1960    8996967.0
3               AFW  1960   96396419.0
4               AGO  1960    5454938.0
...             ...   ...          ...
16221           XKX  2020    1790133.0
16222           YEM  2020   29825968.0
16223           ZAF  2020   59308690.0
16224           ZMB  2020   18383956.0
16225           ZWE  2020   14862927.0

[16226 rows x 3 columns]

In [11]:
df.to_sql('population', engine, if_exists='replace')

## Inflation

In [12]:
df = pd.read_csv(resources / "inflation.csv", skiprows=4).dropna(axis='columns', how='all')
df.drop(columns=['Country Name', 'Indicator Name', 'Indicator Code'], inplace=True)
# unpivot
df = pd.melt(df, id_vars="Country Code")

In [13]:
df.columns = ['country_code3', 'year', 'value']
df

      country_code3  year     value
0               ABW  1960       NaN
1               AFE  1960       NaN
2               AFG  1960       NaN
3               AFW  1960       NaN
4               AGO  1960       NaN
...             ...   ...       ...
16487           XKX  2021  3.353691
16488           YEM  2021       NaN
16489           ZAF  2021  4.611672
16490           ZMB  2021       NaN
16491           ZWE  2021       NaN

[16492 rows x 3 columns]

In [14]:
df.to_sql('inflation', engine, if_exists='replace')

## Military Expenditure (% of GDP)

In [15]:
df = pd.read_csv(resources / "Military_Expenditure.csv", skiprows=4).dropna(axis='columns', how='all')
df.drop(columns=['Country Name', 'Indicator Name', 'Indicator Code'], inplace=True)
# unpivot
df = pd.melt(df, id_vars="Country Code")

In [16]:
df.columns = ['country_code3', 'year', 'value']
df

      country_code3  year     value
0               ABW  1960       NaN
1               AFE  1960       NaN
2               AFG  1960       NaN
3               AFW  1960       NaN
4               AGO  1960       NaN
...             ...   ...       ...
16221           XKX  2020  1.060553
16222           YEM  2020       NaN
16223           ZAF  2020  1.074193
16224           ZMB  2020  1.154225
16225           ZWE  2020       NaN

[16226 rows x 3 columns]

In [17]:
df.to_sql('military', engine, if_exists='replace')